In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='L'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='L'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='L'))
print(s1, s2, s3)

0     4
1     1
2     2
3     2
4     3
     ..
95    1
96    4
97    3
98    3
99    4
Length: 100, dtype: uint32 0     1
1     2
2     2
3     2
4     1
     ..
95    3
96    3
97    3
98    3
99    2
Length: 100, dtype: uint32 0     17559
1     12182
2     24467
3     17650
4     27795
      ...
95    19540
96    17103
97    14469
98    15523
99    12956
Length: 100, dtype: uint32

In [6]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  4  1  17559
1  1  2  12182
2  2  2  24467
3  2  2  17650
4  3  1  27795

In [7]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            17559
1      1       2            12182
2      2       2            24467
3      2       2            17650
4      3       1            27795

In [8]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       1
2       2
3       2
4       3
..    ...
95  19540
96  17103
97  14469
98  15523
99  12956

[300 rows x 1 columns]

In [9]:
len(bigcolumn)

300

In [10]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        1
2        2
3        2
4        3
..     ...
295  19540
296  17103
297  14469
298  15523
299  12956

[300 rows x 1 columns]